w20d3-hw/dating_app/dating_app_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.sample(6)

INSERT INTO "users" ("name", "starsign", "age", "ltl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test Dater1"], ["starsign", "Aries"], ["age", 28], ["ltl", true], ["created_at", "2020-05-07 00:01:23.430870"], ["updated_at", "2020-05-07 00:01:23.430870"]]
---
  def create
    @user = User.new(user_params)

    if @user.save