student_examples/trading_app/trading_app_api/app/controllers/ledgers_controller.rb

  def index
    @ledgers = Ledger.all
---
SELECT "ledgers".* FROM "ledgers"

    def set_ledger
      @ledger = Ledger.find(params[:id])
---
SELECT "ledgers".* FROM "ledgers" WHERE "ledgers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]