w20d2/tweeter_app_api/app/controllers/tweets_controller.rb

    def show
        found_tweet = Tweet.find(params[:id])
        found_replies = Tweet.find(params[:id]).replies
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "replies".* FROM "replies" WHERE "replies"."tweet_id" = $1  [["tweet_id", 1]]

    def create
        ## creating the new object according the Tweet model
        ## limiting input to the specified fields.
        tweet = Tweet.new(tweet_params)
    ## attempting to save the new tweet into our database.
    ## return status code and error if applicable.
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "My first tweet"], ["content", "Just trying this mess out."], ["author", "ty18881"]]

      def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1 WHERE "tweets"."id" = $2  [["title", "Crentist the dentist"], ["id", 4]]